{
  "recipeName": "Banana Breakfast Cookies",
  "recipeDesc": "Made with real bananas and studded with chocolate chips.",
  "recipeServeSize": "Serves 3-4",
  "recipeURL": "https://www.thecookierookie.com/wp-content/uploads/2022/03/step-by-step-photos-for-how-to-make-banana-breakfast-cookies-650x529.jpg",
  "recipeIngredients": [
    "2 bananas mashed",
    "0.5 cup unsalted butter slightly melted (1 stick)",
    "1 cup brown sugar",
    "0.5 cup granulated sugar",
    "1 tablespoon pure vanilla extract",
    "2.5 cups all-purpose flour",
    "1.5cups old fashioned oats",
    "1 tablespoon cornstarch",
    "2 teaspoons ground cinnamon",
    "1 teaspoon baking soda",
    "0.5 teaspoon baking powder",
    "0.5 teaspoon salt",
    "1.25 cups semisweet chocolate chips divided"
  ],
  "recipeInstructions": [
    "In a medium bowl, whisk the flour, oats, cornstarch, cinnamon, baking soda, baking powder, and salt together. Set aside.",
    "Add the mashed bananas, butter, sugars, and vanilla to the bowl of a stand mixer fitted with the paddle attachment. Beat together until well mixed, about 2 minutes.",
    "Pour the dry ingredients into the wet ingredients and beat just until mixed. Do not overmix.",
    "Fold in 1 cup of chocolate chips.",
    "Line 2 baking sheets with parchment paper. Set 1 aside. Use a 2-tablespoon sized cookie scoop to scoop cookies onto the baking sheet. Try to fit all of the cookie dough balls in a single layer on the baking sheet. If the cookies aren’t holding their round shape, use your hands to press the dough balls together to form round cookies. Do not flatten cookies. Press a few of the remaining chocolate chips into the tops of each cookie.",
    "Once all of the dough has been scooped, place the baking sheet of cookie dough balls in the freezer for 10 minutes. This prevents the cookies from spreading too much while they bake.",
    "While the cookie dough freezes, preheat oven to 350°F.",
    "Once the dough has chilled, place some of the chilled cookie dough balls 2 inches apart onto the second prepared baking sheet.",
    "Bake for 10-12 minutes or until the cookie edges are just set and bottoms are slightly browned.",
    "Let the cookies cool completely on the baking sheet before transferring to a container for storage."
  ]
}
