{
  "recipeName": "Easy Chicken Tikka Masala",
  "recipeDesc": "This easy chicken tikka masala recipe is a weeknight staple!",
  "recipeServeSize": "Serves 3-4",
  "recipeURL": "https://www.thecookierookie.com/wp-content/uploads/2022/01/step-by-step-photos-for-how-to-make-chicken-tikka-masala-650x1177.jpg",
  "recipeIngredients": [
    "FOR THE CHICKEN:",

    "4 boneless skinless chicken breasts cubed",
    "1 teaspoon kosher salt",
    "1/2 teaspoon ground black pepper",
    "1/2 teaspoon curry powder",
    "1 teaspoon Garam Masala Indian spice",
    "1-2 teaspoons white sugar - to taste",
    "1/4 cup Greek-style Yogurt",
    "2 tablespoons vegetable oil",
    "",
    "FOR THE SAUCE:",
    "",
    "1 sweet yellow onion finely diced",
    "4 cloves garlic minced",
    "2 tablespoons butter",
    "2 tablespoons olive oil",
    "4 teaspoons cumin",
    "1 teaspoon kosher salt",
    "1 teaspoon ground ginger",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon turmeric",
    "1/8-1/4 teaspoon cayenne pepper (more or less to taste)",
    "1 teaspoon Garam Masala",
    "2 teaspoons paprika",
    "15 ounces tomato sauce (we like thick and zesty)",
    "1 cup heavy whipping cream",
    "4 teaspoons white sugar",
    "Chopped fresh cilantro for garnish"
  ],
  "recipeInstructions": [
    "FOR THE CHICKEN:",
    "Cut the chicken into bite-size pieces and sprinkle with salt, pepper, curry, Garam Masala and sugar. Place it in a bowl or Ziploc bag.",
    "Pour the yogurt over the chicken making sure to cover each piece. Set the chicken aside until ready to cook. If cooking within 10 minutes, it is fine to leave on the counter. If letting it rest more than 10 minutes, refrigerate until ready to cook.",
    "Heat oil in a large skillet over medium heat. Once the oil is hot, add the chicken.",
    "Cook until the chicken is lightly seared and not quite cooked through - still a soft pink in the center. Stir often. Turn off the heat when the chicken is still slightly pink inside.",
    "FOR THE SAUCE:",
    "Heat butter and oil in a different large skillet over medium heat.",
    "Once the oil and butter are hot, add the diced onions. Cook until translucent then add the minced garlic. Cook one minute or until garlic becomes fragrant.",
    "Add cumin, salt, ginger, cinnamon, turmeric, cayenne pepper, Garam Masala and paprika. Cook 1-2 minutes.",
    "Add tomato sauce, reduce heat to low and let the sauce thicken 10-15 minutes, stirring often.",
    "Add the cream and sugar and bring the sauce to a low boil. Add the cooked chicken.",
    "Keep the heat on low and simmer until sauce thickens and chicken is fully cooked - 15-30 minutes more.",
    "Garnish with chopped cilantro and serve with basmati or jasmine rice and Naan bread.",
    "Serve and enjoy."
  ]
}
