{
  "recipeName": "Smoked Pulled Pork",
  "recipeDesc": "This smoked pulled pork is a tender delicious recipe.",
  "recipeServeSize": "Serves 3-4",
  "recipeURL": "https://www.thecookierookie.com/wp-content/uploads/2021/05/smoked-pulled-pork-step-by-step-recipe-photos-650x1266.jpg",
  "recipeIngredients": [
    "Pork Shoulder (roughly 9 lbs)",
    "0.5 cup mustard",
    "0.5 cup Brown Sugar",
    "1.5 Tablespoons Salt",
    "1.5 Tablespoons Ground Black Pepper",
    "1.5 Tablespoons Garlic Powder",
    "1 Tablespoon Paprika",
    "1 Tablespoon Onion Powder",
    "1 Tablespoon Cayenne Pepper",
    "4 ounces Bourbon",
    "16 ounces Apple Juice"
  ],
  "recipeInstructions": [
    "In a small bowl combine the brown sugar, salt, ground black pepper, garlic powder, paprika, onion powder, and cayenne pepper.",
    "Rub down the pork with the mustard, making sure to cover the entire surface, this helps ensure the spices stick to the meat.",
    "Season the pork shoulder generously with the spice mixture – both sides and place back in the fridge to marinate overnight.",
    "Fill the steam pot in the smoker with water and stock the smoker with wood (chunks, chips, pellets…whatever your smoker is designed for).",
    "Smoke the pork at 250 degrees for the first four to six hours.",
    "Combine the bourbon and the apple juice in a spray bottle and spritz the pork shoulder every hour until the pork reaches 160 degrees.",
    "Once the pork has reached 160 degrees, give it one last spritz then remove from the smoker and wrap in foil or butcher paper before returning it to the smoker to finish cooking.",
    "Reduce the temperature to 225 degrees and continue to smoke the pork for an additional four to six hours or util the pork reaches an internal temperature of 195-205 degrees.",
    "Carefully remove the pork from smoker and allow it to rest, still wrapped, for another hour.",
    "Place the shoulder in a large bowl and using meat shredders or two forks, shred the meat (making sure to remove and discard the bone).",
    "Serve on rolls with coleslaw and BBQ sauce, if desired.",
    "Enjoy!"
  ]
}
