{
  "recipeName": "Best Twice Baked Potatoes",
  "recipeDesc": " Twice Baked Potatoes are a classic must make side dish any time of year.",
  "recipeServeSize": "Serves 3-4",
  "recipeURL": "https://www.thecookierookie.com/wp-content/uploads/2020/12/twice-baked-potatoes-step-by-step-process-shots-650x1293.jpg",
  "recipeIngredients": [
    "4 7-8 ounce russet (or large Yukon Gold) potatoes scrubbed, dried and rubbed lightly with canola or vegetable oil",
    "1 cup 4 ounces shredded cheese sharp cheddar, Gruyere, Mexican blend, or your favorite, divided",
    "0.25 cup sour cream or Greek yogurt",
    "0.25 cup buttermilk",
    "4 tablespoons unsalted butter room temperature",
    "2-4 medium scallions thinly sliced, divided",
    "4 strips bacon cut into 0.25in lardons, cooked crisp, divided",
    "Kosher salt",
    "Freshly ground black pepper",
    "Minced fresh herbs for garnish parsley, thyme, cilantro, chives"
  ],
  "recipeInstructions": [
    "Preheat oven to 400F and adjust the oven rack to the middle position. Place a cooking rack over a foil-lined baking sheet.",
    "Lightly rub each potato with oil and sprinkle with salt and freshly ground black pepper. Place the potatoes, evenly spaced, on the rack over the prepared baking sheet.",
    "Bake the potatoes to an internal temperature of 209F or until fork tender (45 minutes-1 hour).",
    "Remove the potatoes from the oven, and leave the oven on.Once the potatoes have cooled on the rack 10 minutes, cut the potatoes in half crosswise. Leave a 1/8 inch-1/4-inch thickness of flesh in each shell, and carefully scoop out the potato flesh into a medium-large mixing bowl.Transfer the potato shells back to the prepared baking sheet and cook at 400F for 10 minutes (this is so the shells can crisp a little and hold their shape after filling).",
    "While the shells cook, mash together half the cheese, sour cream, buttermilk, half the butter, half the scallions, and half the bacon lardons with the baked potato flesh until smooth. Season with salt and pepper and mix together.",
    "Transfer shells from the oven and set the oven to broil. Fill the potato shells, mounding in the middle, with the mashed potato mixture and top with remaining cheese, scallions, bacon lardons, and butter.",
    "Broil until the cheese has melted and the potatoes are spotty brown and little crispy on top, approximately 5-10 minutes. Watch closely.",
    "Allow the potatoes to cool 10 minutes and serve.",
    "Enjoy!"
  ]
}
